Medium_mesh_40000/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type    calculated;
    }

    outlet
    {
        type    calculated;
    }

    topwall
    {
        type    calculated;
    }

    bottomwall
    {
        type    calculated;
    }

    cylinder
    {
        type    calculated;
    }

    frontAndBackPlanes
    {
        type    empty;
    }
}


// ************************************************************************* //
