Medium_mesh_40000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          78;
        startFace       82742;
    }
    outlet
    {
        type            patch;
        nFaces          78;
        startFace       82820;
    }
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          464;
        startFace       82898;
    }
    bottomwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          464;
        startFace       83362;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       83826;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          83384;
        startFace       84026;
    }
)

// ************************************************************************* //
